betajunkies/app/controllers/comments_controller.rb

SELECT * FROM "comments" WHERE ("comments"."id" = 953125641)
---
  def show
    @comment = Comment.find(params[:id])

SELECT * FROM "comments" WHERE ("comments"."id" = 953125641)
---
  def edit
    @comment = Comment.find(params[:id])

SELECT * FROM "comments" WHERE ("comments"."id" = 953125641)
SELECT * FROM "projects" WHERE ("projects"."id" = 4)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
INSERT INTO "comments" ("created_at", "parent", "title", "project_id", "updated_at", "rating_total", "date", "rating_avg", "user_id", "rating_count", "content") VALUES('2009-02-14 17:01:53', NULL, NULL, 3, '2009-02-14 17:01:53', NULL, '2009-02-14 17:01:53', NULL, 1, NULL, 'Quisque pede diam, tempor vel; volutpat non, bibendum at, metus. Ut lorem elit, pharetra vel, dictum ac, egestas at; mi. Nunc et mi. Donec adipiscing, massa non hendrerit pulvinar, nisi ante accumsan neque, ut porta felis diam et nibh. Quisque elit. Nulla at neque ut turpis hendrerit aliquet. Nullam tincidunt viverra justo. Donec orci. Nunc consectetur odio ac elit venenatis semper. Suspendisse potenti. Cras id sem sit amet diam euismod vulputate. Suspendisse id nunc.')
INSERT INTO "tags" ("name") VALUES('curagea')
---
  def create
    @comment = Comment.new(params[:comment])
	@comment.project = Project.find(params[:project_id])
	@comment.user = User.find(session[:user_id])
	@comment.date = Time.now
	@comment.tag_list.add(@comment.user.login)


    respond_to do |format|
      if @comment.save

SELECT * FROM "comments" WHERE ("comments"."id" = 3) LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
INSERT INTO "comments" ("created_at", "parent", "title", "project_id", "updated_at", "rating_total", "url", "date", "rating_avg", "user_id", "rating_count", "content") VALUES('2009-02-14 18:24:13', 6, NULL, NULL, '2009-02-14 18:24:13', NULL, NULL, '2009-02-14 18:24:13', NULL, 3, NULL, 'You''re such a hater!')
SELECT * FROM "projects" WHERE ("projects"."id" = 3)
---
  def createthreaded
    @comment = Comment.new(params[:comment])
       @comment.parent = params[:comment][:parent]
       @comment.user = User.find(session[:user_id])
       @comment.date = Time.now
@comment.tag_list.add(@comment.user.login)

    respond_to do |format|
      if @comment.save
        flash[:notice] = 'Comment was successfully created.'
	@parent = Comment.find_by_id(@comment.parent)
	while @parent.project == nil
            @parent = Comment.find_by_id(@parent.parent)

SELECT * FROM "comments" WHERE ("comments"."id" = 953125641)
---
  def update
    @comment = Comment.find(params[:id])

SELECT * FROM "comments" WHERE ("comments"."id" = 953125641)
DELETE FROM "comments" WHERE "id" = 953125641
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy