betajunkies/app/controllers/projects_controller.rb

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def show
    @project = Project.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = 3)
---
	def annotate
		@project = Project.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = 8)
---
  def edit
    @project = Project.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = 953125641)
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
INSERT INTO "projects" ("name", "created_at", "updated_at", "user_id", "link", "description", "summary") VALUES('Beta Junkies', '2009-02-14 03:57:08', '2009-02-14 03:57:08', 0, 'www.google.com', 'Aenean ultricies, turpis luctus varius lobortis; felis ipsum dignissim diam, at vestibulum enim nibh a dui. Fusce tincidunt consectetur odio. Nunc vel justo nec neque sodales elementum. Aenean in nulla. Nam in orci eget dui tincidunt tempus. Etiam dictum dui sit amet dolor. Aliquam viverra tellus in lectus. Nam pulvinar. Nam tempus fermentum augue. Nulla nec mauris. In dui massa, congue et, hendrerit quis, imperdiet id, ligula. Nam feugiat. Etiam sagittis, dui ut venenatis pharetra, metus diam feugiat orci, at egestas justo lacus sed eros. In consequat, orci quis feugiat vehicula, purus justo tempus sem, mattis eleifend ante justo vel turpis.
---
  def create
    @project = Project.new(params[:project])
    @project.user = User.find(session[:user_id])

    respond_to do |format|
      if @project.save

SELECT * FROM "projects" WHERE ("projects"."id" = 7)
UPDATE "projects" SET "updated_at" = '2009-02-14 07:09:40', "description" = 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Pellentesque dapibus elit sit amet ligula. Vestibulum iaculis molestie enim. Suspendisse potenti. Duis rutrum. Proin lacinia. Sed consequat viverra sapien. Pellentesque facilisis mi quis dui? Phasellus blandit lorem nec nibh. Aenean feugiat blandit ipsum. Integer aliquet nunc eu justo. Ut libero lacus.' WHERE "id" = 4
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])

SELECT * FROM "projects" WHERE ("projects"."id" = 3)
DELETE FROM "projects" WHERE "id" = 3
---
  def destroy
    @project = Project.find(params[:id])
    @project.destroy