betajunkies/app/controllers/ratings_controller.rb

  def show
    @rating = Rating.find(params[:id])
---
SELECT * FROM "ratings" WHERE ("ratings"."id" = 953125641)

  def edit
    @rating = Rating.find(params[:id])
---
SELECT * FROM "ratings" WHERE ("ratings"."id" = 953125641)

  def create
    @rating = Rating.new(params[:rating])
    @rating.user_id = session[:user_id]
    @rating.created_at = Time.now

    respond_to do |format|
      if @rating.save
        flash[:notice] = 'Rating was successfully created.'
	if @rating.project_id != nil
          format.html { redirect_to(:controller => 'projects', :action => 'show', :id => @rating.project_id) }
	else
          @parent = Comment.find_by_id(@rating.comment_id)
---
INSERT INTO "ratings" ("project_id", "updated_at", "value", "user_id", "comment_id", "created_at") VALUES(NULL, '2009-02-14 11:15:48', NULL, NULL, NULL, '2009-02-14 11:15:48')
SELECT * FROM "comments" WHERE ("comments"."id" = 1) LIMIT 1
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def update
    @rating = Rating.find(params[:id])
---
SELECT * FROM "ratings" WHERE ("ratings"."id" = 953125641)

  def destroy
    @rating = Rating.find(params[:id])
    @rating.destroy
---
SELECT * FROM "ratings" WHERE ("ratings"."id" = 953125641)
DELETE FROM "ratings" WHERE "id" = 953125641