betajunkies/app/controllers/sites_controller.rb

  def index
    if Project.find(:all) != nil
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1) LIMIT 1