betajunkies/app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO "users" ("salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('d8f4ad00f85d3ffa57d2f749c1f0c1bc43a7acc6', '2009-02-14 03:56:03', '4a536f39bcf90375b06764799c49a0a18b5ff2dd', NULL, '2009-02-14 03:56:03', NULL, 'curagea', 'hannahlhu@gmail.com')

  def view
    @user = User.find_by_id(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def index
    @users = User.find(:all)
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1