frontpage_poll/app/controllers/email_reqs_controller.rb

SELECT * FROM "email_reqs" WHERE ("email_reqs"."id" = 1)
---
  def show
    @email_req = EmailReq.find(params[:id])

INSERT INTO "email_reqs" ("created_at", "updated_at", "email") VALUES('2009-04-19 21:22:05', '2009-04-19 21:22:05', 'test@test.com')
SELECT "email_reqs".id FROM "email_reqs" WHERE ("email_reqs"."email" = '') LIMIT 1
---
  def create
    @email_req = EmailReq.new(params[:email_req])

    respond_to do |format|
      if @email_req.save
        format.html { redirect_to(@email_req) }
        format.xml  { render :xml => @email_req, :status => :created, :location => @email_req }
      else
        if EmailReq.find_by_email @email_req.email